---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternalDefinitions
source: html/33292806-d47d-a580-4b19-d902452d3c8d.htm
---
# ExternalDefinitions Methods

Tests for the existence of a definition within the set.